Revit 2026 API

# DividedSurfaceIsComponentMirrored Property

---

Whether the pattern is mirror-imaged.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsComponentMirrored { get; set; }
```
```vb
Public Property IsComponentMirrored As Boolean
	Get
	Set
```
```cpp
public:
property bool IsComponentMirrored {
	bool get ();
	void set (bool value);
}
```
```fsharp
member IsComponentMirrored : bool with get, set
```

#### Property Value

Boolean

This property has no effect unless a pattern is selected (the ObjectType property is not ). Changing this flag effectively reflects the component through its YZ-plane.

#### Reference

DividedSurface Class

Autodesk.Revit.DB Namespace